[
  {
    "header": "Home",
    "content": "I grew up in Sault Ste Marie, Ontario (between Lakes Superior & Huron). Being a small northern city, I spent my summers outdoors at our family 'camp' (what Northerners call anything from a trailer to a summer home) and my winters cross country skiing. I moved to Toronto in 1991 and stayed there for 30 years building up my skills and career. In 2021, I moved back to my home town of Sault Ste Marie to be closer with my family and to reconnect with the North."
  },
  {
    "header": "Family",
    "content": "We (Nicole & I) started our family in our mid 20's after having moved to Toronto in 1991. Our two kids are now both in their early 20's and are starting lives of their own. Our daughter had our first grandson in 2020 - cute as a button, smart like fox. I'm lucky to still have both parents to reconnect with here in the Sault and to hang out with my brother and his family."
  },
  {
    "header": "Engineering",
    "content": "My curiosity with how things work started very young. I would often take things apart to see how they work (often guided my brother who's 4yrs senior). I started coding in grade 6 by writing little mad-lib programs on the Commodore PET. In high school, I coded up a program to test a music student's knowledge of key signatures and intervals in Watcom BASIC (on the UNISYS Icon II). After moving to Toronto, I got into multimedia (kiosks, mixed-mode CDs) and in 1992, jumped into learning about this new thing called the World Wide Web. Having been in it since it's invention, I've seen the web evolve over the decades. I started with HTML, moved on the CGI/Perl and JavaScript when that came out. I did some work in Java when that was released and found my way to PHP in the late 90's. I spent a few years focused on back-end dev (as JS was bananas to work with in the early 2000's) having done lots of work in PHP and some with Java/JSP and eventually NodeJS. When JS became sane again in the 2000's, I rediscovered JS through the various front-end frameworks (JQuery was a great first step) having done recent work in Angular, React and NextJS. The past few years I've also been enjoying firmware dev via Arduino. All this to show that I have a very deep & wide knowledge in most things code."
  },
  {
    "header": "Design",
    "content": "In the late 90's I started exploring the relatively new practice of Information Architecture. This new practice allowed for the much needed time to design an experience before starting any visual design or development. The early days focused on taxonomies, wireframes, labeling & search systems and site maps. Over the decades it's evolved into a very mature discipline (usually referred to as User Experience Design) involving many roles including User Research, Visual Design, Information Architecture, Interaction Design and more (what UX design is and encompasses is still a bit of a hot topic). From the late 2000's my career focused on UX Design (often called UX Product Design now). I worked for a lot of ad agencies and production companies since then, having designed hundreds of experiences. Recently, I've been dabbling in visual design as well. I've always been very good at guiding & recognizing a great visual design, but was never very good at visual design myself. But I'm getting better as I do more visual design work for my own personal projects (like this portfolio)."
  },
  {
    "header": "Teaching",
    "content": "I taught at Centennial College in the Continuing Education faculty from 1995 to 2005. I was first brought in to cover for an instructor who bailed on the HTML course he was teaching. I got great reviews from the students so the college asked me to keep going, so I did. During my 10yrs there I developed and taught courses in HTML, CGI/Perl, Java, JavaScript, databases and PHP. I also developed three certificate programs for their CE program related to web development & publishing. I received consistently positive evaluations for every course I taught. In 1998 I was invited to sit on a Program Advisory Committee to develop a post-graduate program in Information Architecture. I was quite active in the PHP community at that time as well, running a PHP user group and I wrote PHP articles for PHP Architect magazine and O'Reilly OnLamp."
  },
  {
    "header": "Volunteering",
    "content": "My first meaningful volunteering experience was as a scout leader in the early 2000's. In 2004, I was invited to join a Rotary club - The Rotary Club of East York in Toronto. Rotary changed my outlook on the world and it's problems, showing what's possible when a dedicated group of people work together for a common cause. Whether they be big global issues like ending Polio or smaller local issues like food equality. I've held many roles as a Rotarian over the years and I've also used my expertise to help Rotary clubs and Rotarians with effective use of technology."
  },
  {
    "header": "Fun",
    "content": "I do manage to find time for fun things. I'm an active sailor, very much looking forward to exploring the North Channel in Lake Huron and hopefully we'll find our way to various destinations in Lake Michigan. I love skiing and I look forward to rekindling my love for cross country skiing up here in the North - my time in Toronto limited me to downhill mostly. My education is, oddly enough, in music production. I did a few recording projects and live sound gigs in the early 90's and I still dabble in music production as a hobby. Lastly, my brother and I are starting to make things out of wood, but more on that later."
  }
]